saf_payload_subscription_service.xml

<?xml version="1.0" encoding="utf-8" ?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Body>
		<ns1:syncOrderRelation
			xmlns:ns1="http://www.csapi.org/schema/parlayx/data/sync/v1_0/local">
			<ns1:userID>
				<ID>254720988636</ID>
				<type>0</type>
			</ns1:userID>
			<ns1:spID>601727</ns1:spID>
			<ns1:productID>MDSP2000266220</ns1:productID>
			<ns1:serviceID>6017272000123062</ns1:serviceID>
			<ns1:serviceList>6017272000123062</ns1:serviceList>
			<ns1:updateType>1</ns1:updateType>
			<ns1:updateTime>20170323142301</ns1:updateTime>
			<ns1:updateDesc>Addition</ns1:updateDesc>
			<ns1:effectiveTime>20170323142301</ns1:effectiveTime>
			<ns1:expiryTime>20361231210000</ns1:expiryTime>
			<ns1:extensionInfo>
				<item>
					<key>accessCode</key>
					<value>40420</value>
				</item>
				<item>
					<key>chargeMode</key>
					<value>0</value>
				</item>
				<item>
					<key>MDSPSUBEXPMODE</key>
					<value>1</value>
				</item>
				<item>
					<key>objectType</key>
					<value>1</value>
				</item>
				<item>
					<key>isAutoExtend</key>
					<value>0</value>
				</item>
				<item>
					<key>shortCode</key>
					<value>40420</value>
				</item>
				<item>
					<key>isFreePeriod</key>
					<value>false</value>
				</item>
				<item>
					<key>payType</key>
					<value>1</value>
				</item>
				<item>
					<key>transactionID</key>
					<value>504021504481703110028510721044</value>
				</item>
				<item>
					<key>orderKey</key>
					<value>999000000213074149</value>
				</item>
				<item>
					<key>isSubscribeCnfmFlow</key>
					<value>true</value>
				</item>
				<item>
					<key>status</key>
					<value>0</value>
				</item>
				<item>
					<key>validTime</key>
					<value>20361231210000</value>
				</item>
				<item>
					<key>keyword</key>
					<value>be100</value>
				</item>
				<item>
					<key>cycleEndTime</key>
					<value>20170422210000</value>
				</item>
				<item>
					<key>durationOfGracePeriod</key>
					<value>-1</value>
				</item>
				<item>
					<key>serviceAvailability</key>
					<value>0</value>
				</item>
				<item>
					<key>channelID</key>
					<value>143</value>
				</item>
				<item>
					<key>TraceUniqueID</key>
					<value>504021504481703110028510721045</value>
				</item>
				<item>
					<key>operCode</key>
					<value></value>
				</item>
				<item>
					<key>rentSuccess</key>
					<value>true</value>
				</item>
				<item>
					<key>try</key>
					<value>false</value>
				</item>
			</ns1:extensionInfo>
		</ns1:syncOrderRelation>
	</soapenv:Body>
</soapenv:Envelope>