syncOrderRelationRequest.xml

<soapenv:Envelope
	xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:loc="http://www.csapi.org/schema/parlayx/data/sync/v1_0/local">
	<soapenv:Header/>
	<soapenv:Body>
		<loc:syncOrderRelation>
			<loc:userID>
				<ID>254721214848</ID>
				<type>0</type>
			</loc:userID>
			<loc:spID>602078</loc:spID>
			<loc:productID>MDSP2000052892</loc:productID>
			<loc:serviceID>6013992000001442</loc:serviceID>
			<loc:serviceList>601399200000144</loc:serviceList>
			<loc:updateType>1</loc:updateType>
			<loc:updateTime>20181212113107</loc:updateTime>
			<loc:updateDesc>Addition</loc:updateDesc>
			<loc:effectiveTime>20181212113107</loc:effectiveTime>
			<loc:expiryTime>20181212113107</loc:expiryTime>
			<loc:extensionInfo>
				<namedParameters>
					<key>TransactionID</key>
					<value>1339730498361</value>
					<key>orderKey</key>
					<value>999000000009508556</value>
					<key>MDSPSUBEXPMODE</key>
					<value>1</value>
					<key>objectType</key>
					<value>1</value>
					<key>TraceUniqueID</key>
					<value>06212031580010010012</value>
					<key>rentSuccess</key>
					<value>false</value>
				</namedParameters>
			</loc:extensionInfo>
		</loc:syncOrderRelation>
	</soapenv:Body>
</soapenv:Envelope>